bundles_binding_org.openhab.binding.ihc_src_main_java_org_openhab_binding_ihc_utcs_IhcClient.java/[CN]/IhcClient/[MT]/waitStateChangeNotifications(WSControllerState,int)/body

{
  String soapQuery="<?xml version=\"1.0\" encoding=\"UTF-8\"?>" + "<soapenv:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\">" + "<soapenv:Header/>"+ "<soapenv:Body>"+ " <ns1:waitForControllerStateChange1 xmlns:ns1=\"utcs\" xsi:type=\"ns1:WSControllerState\">"+ "  <ns1:state xsi:type=\"xsd:string\">" + previousState.getState() + "</ns1:state>"+ " </ns1:waitForControllerStateChange1>"+ " <ns2:waitForControllerStateChange2 xmlns:ns2=\"utcs\" xsi:type=\"xsd:int\">"+ timeoutInSeconds+ "</ns2:waitForControllerStateChange2>"+ "</soapenv:Body>"+ "</soapenv:Envelope>";
  Map<String,String> listOfProperties=new HashMap<String,String>();
  listOfProperties.put("SOAPAction","waitForControllerStateChange");
  String response=sendQuery("ControllerService",soapQuery,timeoutInSeconds * 1000 + timeout,listOfProperties);
  String state=parseValue(response,"/SOAP-ENV:Envelope/SOAP-ENV:Body/ns1:waitForControllerStateChange3/ns1:state");
  WSControllerState controllerState=new WSControllerState();
  controllerState.setState(state);
  return controllerState;
}
